# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'  # required for phpmon

# Binaries
brew 'git'
brew 'mas'
brew 'trash'

# Dev
brew 'php'
brew 'php@7.4'
brew 'php@8.0'
brew 'composer'
brew 'gh'
brew 'nginx'
brew 'nvm'
brew 'yarn'

# Fonts
cask 'font-fira-code'

# Apps
cask '1password'
cask 'adobe-creative-cloud'
cask 'browserstacklocal'
cask 'cyberduck'
cask 'dropbox'
cask 'firefox'
cask 'flux'
cask 'github'
cask 'gog-galaxy'
cask 'google-chrome'
cask 'google-drive'
cask 'handbrake'
cask 'imageoptim'
cask 'iterm2'
cask 'kaleidoscope'
cask 'local'
cask 'phpmon'
cask 'protonvpn'
cask 'screaming-frog-seo-spider'
cask 'sim-daltonism'
cask 'sip'
cask 'slack'
cask 'spotify'
cask 'tableplus'
cask 'temurin' # required for screaming-frog-seo-spider
cask 'visual-studio-code'
cask 'zoom'

# Mac App Store
mas 'Bear', id: 1091189122
mas 'JumpIn', id: 1506451016

# Have to install these apps manually
# Logi Tune: https://www.logitech.com/en-us/video-collaboration/software/logi-tune-software.html
# Cisco Anyconnect: https://help.unc.edu/sp?id=kb_article_view&sysparm_article=KB0010155&sys_kb_id=719db1eddb3fa41070551ffa689619eb
# Hive: https://hive.com/applications/
# Backblaze (there is a cask for this but it doesn't install it completely): https://secure.backblaze.com/update.htm
